{
  "education": [
    {
      "awards_achievements": [
        "Entrance Scholarship",
        "Dean's List (2018)",
        "GPA: 3.39/4.0"
      ],
      "degree": "Bachelor of Computer Science",
      "department": "Computer Science",
      "duration": "Sept 2018 - Aug 2022",
      "school_name": "Universoty of Toronto"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_JunaidSyed",
  "highlighted_projects": [
    {
      "description": "Hexagon Security is a browser-centric security tool, capable of managing a user's secure data including passwords, MFA keys, and notes. As part of this tool, there is a website to manage data, along with a chrome extension to facilitate quick actions such as saving/autofilling passwords and adding MFA keys to their profile.",
      "git_url": "https://github.com/junaidsyedali/hexagon-security",
      "name": "Hexagon Security"
    },
    {
      "description": "A restaurant-oriented rewards platform with 2 web apps to support reward curation and client management alongside a static website to document development progress.",
      "git_url": "https://github.com/junaidsyedali/bytes-rewards",
      "name": "Byte Rewards"
    }
  ],
  "jarvis_projects": [
    {
      "description": "This Linux cluster monitor project is an agent monitoring tool which uses bash scripts to record host hardware specifications (model, architecture, etc) and host hardware usage (memory, cpu usage, etc). The recorded information is then stored in a PostgresSQL database. The hardware specifications are captured and stored once on installation while hardware usage is monitored every minute. This data can then be used by an infrastructure team in the future to generate reports and resource planning.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Junaid Ali Syed",
  "others": [
    {
      "bullets": [
        "Udacity Machine Learning (2019)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Winner"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Basketball player",
        "Competitive gaming",
        "Volunteer, ABC Food bank: Ut enim ad minim veniam"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Applied agile scrum principles to develop multiple projects using SQL, and Java such as the Twitter, JDBC, and Grep apps. Utilized Git and Git flow branching model to establish organized and maintainable projects which can be seen on GitHub. Participated and facilitated daily scrum meetings sessions about work progress to ensure team is on track with team goals and deadlines.",
      "duration": "Nov 2022 - present",
      "title": "Software Developer"
    },
    {
      "company": "Intellijoint Surgical",
      "description": "Developed and maintained a client focused surgical application with React to ensure usability of project features according to user requirements. Maintained and created test cases of API endpoints to ensure correct functionality of deleting and modifying clinical patient data. Participated effectively and regularly with manager and coworkers with daily scrum meetings and planning sessions about current work progress and future tasks.",
      "duration": "Sept 2021 ? Dec 2021",
      "title": "Software Develoepr"
    },
    {
      "company": "Ministry of Education Ontario",
      "description": "Utilized HP ALM to create and execute smoke and regression tests of existing and new applications to ensure working functionality for production. Maintained accuracy of reports and resolved test failures by finding the root cause of the problem. Used PL/SQL to maintain Oracle relational databases by querying and updating information to keep up to date and relevant information for test case executions. Communicated effectively and regularly with manager and coworkers about current progress and defects with reports and tickets to convey relevant information.",
      "duration": "Sept 2021 ? Dec 2021",
      "title": "Quality Assurance Analyst"
    }
  ],
  "skills": {
    "competent": [
      "React",
      "REST",
      "C",
      "JavaScript",
      "Node.js",
      "Express.js",
      "GraphQL"
    ],
    "familiar": [
      "C#",
      "C++",
      "Kotlin",
      "TypeScript",
      "App Development"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Python",
      "Git",
      "SQL"
    ]
  },
  "summary": "I am recent graduate from University of Toronto with a specialization in software engineering. During my studies, I had the opportunity to work with different programming technologies including C, python, Java, React, javascript, relational and non-relational databases. I have applied my knowledge of these technologies with different projects which can be found on my GitHub. I also have experience with multiple internships as a QA with Ministry of Education Ontario and as a software developer with Intellijoint Surgical. My software developer position was my most recent internship as I worked in an agile scrum environment while following the Git flow branching model. My Main responsibilities included making enhancements and implementing new features to their hip surgical application tools with regular code reviews involving senior developers. Currently, I am a Software engineer at Jarvis where I have learnt and upgraded my knowledge on technologies and skills. These include core java programming, testing, deployment, fundamental programming patterns/principles and much more. My journey of becoming a software developer has been filled with continuous learning from as early as high school. I am an individual who is able to quickly adapt to the environment, enthusiastic about learning and an amazing problem solver. I am passionate and self-driven in the path that I have chosen where my future goals involve me in joining a company to utilize my knowledge in making creative solutions that are maintainable and impactful."
}
